Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetZ
The property labeled "Offset Z" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.TextureAngle
The property labeled "Angle" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray3d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.MarbleWidth
The property labeled "Vein Width" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.MarbleSize
The property labeled "Vein Spacing" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.MarbleColor2
The property labeled "Vein Color" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble.MarbleColor1
The property labeled "Stone Color" from the "Marble" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Marble
Represents the properties of materials.
Since:
2018.1